#+PROPERTY:header-args :mkdirp yes :exports code :noweb no-export
#+OPTIONS: broken-links:t


*** Converting the uploaded TCX file
When the user submits the form, the file arrives at the respective =ActivitiesController= action. User will be redirected back to the front page. In between, the TCX file is converted into an intermediate =TcxActivity= and finally to =Activity= compatible with our database setup.
#+NAME: Create Activity from uploaded TCX
#+begin_src haskell
  action CreateActivityAction = do
    <<Convert uploaded TCX into TcxActivity>>
    <<Convert TcxActivity into Activity and other database records>>
    <<Congratulate upload and redirect>>
#+end_src

#+name: Congratulate upload and redirect
#+transclude: [[file:Web/Controller/Activities.hs::setSuccessMessage]]  :src haskell :thingatpt paragraph

The TCX file we've received is an XML-formatted file. In the file, Trackpoints are of most interest as it keeps track of heart rate, speed and time, but Lap and Activity have some useful metadata too. An example TCX produced by a 5-second workout:
#+NAME: TCX XML for case 1
#+transclude: [[file:test.tcx]]  :src xml

The following type structures are directly derived from this XML structure with irrelevant data pruned out. We end up with a tree structure going from Activity, to Lap, to Trackpoint. Intermediate types are prefixed by 'Tcx' to avoid collisions with IHP's database-derived types. Intermediate types are used to easen the transition between top-down tree structure idiomatic to Haskell records and bottom-up tree structures idiomatic to relational databases. Activity type for conversion:
#+NAME: TcxActivity
#+transclude: [[file:Web/Types.hs::data TcxActivity]]  :src haskell :thingatpt paragraph

And the database schema derived from it:
#+NAME: Activity schema
#+transclude: [[file:Application/Schema.sql::CREATE TABLE activities]]  :src sql :end "CREATE TABLE laps"

Activities consist of one or more laps.
#+NAME: TcxLap
#+transclude: [[file:Web/Types.hs::data TcxLap]]  :src haskell :thingatpt paragraph
#+NAME: Lap schema
#+transclude: [[file:Application/Schema.sql::CREATE TABLE laps]]  :src sql :end "CREATE TABLE trackpoints"

Laps in turn consist of tracks which are collections of trackpoints. We will assume any extra tracks can be concatenated into one single track to simplify the data model.
#+NAME: TcxTrackpoint
#+transclude: [[file:Web/Types.hs::data TcxTrackpoint]]  :src haskell :thingatpt paragraph
#+NAME: Trackpoint schema
#+transclude: [[file:Application/Schema.sql::CREATE TABLE trackpoints]]  :src sql

Along with some descriptive aliases for primitive types in the application.
#+NAME: tcx types
#+transclude: [[file:Web/Types.hs::type TotalTimeSec]]  :src haskell :thingatpt paragraph

The [[TCX XML for case 1][example TCX file]] should then parse into a structure like so.
#+name: TCX XML for case 1 converted to a record
#+begin_src haskell
  [TcxActivity
    { tcxLaps =
       [ TcxLap
         { tcxLapStart = 2024-03-19 12:28:25.47 UTC
         , tcxLapTotal = 5.0
         , tcxLapDistance = 0.0
         , tcxCals = 1
         , tcxAvgHR = 61
         , tcxMaxHR = 62
         , tcxIntensity = "Active"
         , tcxTrigger = "Manual"
         , tcxTrack =
             [ TcxTrackpoint
               { tcxTpTime = 2024-03-19 12:28:25.47 UTC
               , tcxTpDistance = 0.0
               , tcxTpHR = 62
               , tcxSensor = "Present"
               }
             , TcxTrackpoint
               { tcxTpTime = 2024-03-19 12:28:26.47 UTC
               , tcxTpDistance = 0.0
               , tcxTpHR = 61
               , tcxSensor = "Present"
               }
             , TcxTrackpoint
               { tcxTpTime = 2024-03-19 12:28:27.47 UTC
               , tcxTpDistance = 0.0
               , tcxTpHR = 61
               , tcxSensor = "Present"
               }
             , TcxTrackpoint
               { tcxTpTime = 2024-03-19 12:28:28.47 UTC
               , tcxTpDistance = 0.0
               , tcxTpHR = 61
               , tcxSensor = "Present"
               }
             , TcxTrackpoint
               { tcxTpTime = 2024-03-19 12:28:29.47 UTC
               , tcxTpDistance = 0.0
               , tcxTpHR = 61
               , tcxSensor = "Present"
               }
             ]
         }
       ]
   , tcxSport = "Other"
   , tcxActStart = 2024-03-19 12:28:24.47 UTC
   , tcxPlanType = "Workout"
   , tcxDeviceName = "Polar INW3N_V2"
   }]
#+end_src

We can now make a unit testing file for these conversions. Since the XML files are big and not trivially referenced in string form in Haskell, we'll load it from a file.
#+name: TCX unit tests
#+transclude: [[file:Test/Application/TCXSpec.hs::tcxToRecord :: Spec]]  :src haskell :thingatpt paragraph

First we'll convert the uploaded XML into the =TcxActivity= record type. TCX files can theoretically have multiple =Activities=, but they are not expected in this case. Neither is graceful exception handling required due to threaded nature of IHP and the singular purpose of the upload request, so using =fromJust= as a shortcut is fine for now.
#+name: Convert uploaded TCX into TcxActivity
#+transclude: [[file:Web/Controller/Activities.hs::let tcx :: TcxActivity]]  :src haskell :end "activity <- newRecord"

The external functions used in these conversions. Using =fromJust= is fine, since we can expect XML to be correctly formed and in malformed cases the silent =error= is not an issue. The service will keep on running in these cases. We will now make the conversion function =processTcxUpload=.
#+name: Import TCX conversion functions
#+transclude: [[file:Web/Controller/Activities.hs::import Application.TCX]]  :src haskell :thingatpt paragraph

Since there are no libraries available for directly extracting the TCX format, we'll construct a filter chain using =xml-conduit= (Text.XML and Text.XML.Cursor). There are two entry points to this TCX extractor: =processTcxFile= and =processTcxUpload=. Either approach would be fine with IHP's file uploading routine, but converting from =Text= rather than from =FilePath= inside =IO= monad is more straightforward. XML extractors like /Haskell XML Toolkit/ only work with files, so having =processTcxFile= is fulfilling idiomatic expectations, but also enables testing with larger files.
#+transclude: [[file:Application/TCX.hs::processTcxFile ::]]  :src haskell :end "getActivities ::"

Extracting the fields in this case is logically simple if repetitive and verbose. It could be cleaned up with some helper functions. =read= is used, but as before, graceful exception handling is not required here, although could be relatively easily added since the return value of =[TcxActivity]= is essentially a =Maybe= structure.
#+transclude: [[file:Application/TCX.hs::getActivities ::]]  :src haskell

Having put all this together, we can now convert a TCX file into a Haskell record structure:
#+begin_src haskell
  :l Test/Main
  hspec $ Test.Application.TCXSpec.tcxToRecord
#+end_src

#+RESULTS:
: processTcxFile
:   can convert TCX file into TcxActivity [v]
:
: Finished in 0.0013 seconds
: 1 example, 0 failures

Then we can do a type conversion similar to the one we did in when reading the XML: converting from the intermediate =TcxActivity= into the =Activity=  and others, which are then saved in the database via =createRecord= and its merged INSERT variation =createMany=. IHP will then be using =Activity=, =Lap= and =Trackpoint= in the views.
#+name: Test converting TcxActivity into database records
#+begin_src haskell
  it "adds a TCX upload successfully into database" $ withContext do
    tcx <- fromJust . head <$> processTcxFile "test.tcx"
    <<Convert TcxActivity into Activity and other database records>>
    actCount <- query @Activity |> fetchCount
    actCount `shouldBe` 1
    lapCount <- query @Lap |> fetchCount
    actCount `shouldBe` 1
    tpCount <- query @Trackpoint |> fetchCount
    tpCount `shouldBe` 5
#+end_src

#+name: Convert TcxActivity into Activity and other database records
#+begin_src haskell
  activity <- newRecord @Activity
              |> set #sport (tcxSport tcx)
              |> set #startTime (tcxActStart tcx)
              |> set #planType (tcxPlanType tcx)
              |> set #deviceName (tcxDeviceName tcx)
              |> createRecord
  laps <- createMany $ map (\lap -> newRecord @Lap
                        |> set #activityId (unpackId activity.id)
                        |> set #startTime (tcxLapStart lap)
                        |> set #totalTime (tcxLapTotal lap)
                        |> set #distance (tcxLapDistance lap)
                        |> set #calories (tcxCals lap)
                        |> set #averageHr (tcxAvgHR lap)
                        |> set #maximumHr (tcxMaxHR lap)
                        |> set #intensity (tcxIntensity lap)
                        |> set #trigger (tcxTrigger lap)
               ) (tcxLaps tcx)
  let lapIdsWithTracks = zip (map (.id) laps) (map tcxTrack $ tcxLaps tcx)
  mapM_ (\(lapId, tcks) ->
           createMany $ map (\tck -> newRecord @Trackpoint
                          |> set #lapId (unpackId lapId)
                          |> set #pointTime (tcxTpTime tck)
                          |> set #distance (tcxTpDistance tck)
                          |> set #hr (tcxTpHR tck)
                          |> set #sensor (tcxSensor tck)
                 ) tcks
        ) lapIdsWithTracks
#+end_src

These two conversions then come together and with the results saved into database with =createRecord= and =createMany= earlier, we can congratulate the user and move them into the Activities index. *TODO: we'll move the user to the uploaded activity*

